Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # yandex_compute_disk.nfs-disk has been deleted
- resource "yandex_compute_disk" "nfs-disk" {
      - id          = "epd45bm9hgd3dvk7heli" -> null
        name        = "nfs-disk"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # local_file.inventory will be created
+ resource "local_file" "inventory" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../playbooks/inventory.yml"
      + id                   = (known after apply)
    }

  # yandex_compute_disk.nfs-disk will be created
+ resource "yandex_compute_disk" "nfs-disk" {
      + block_size  = 4096
      + created_at  = (known after apply)
      + folder_id   = (known after apply)
      + id          = (known after apply)
      + name        = "nfs-disk"
      + product_ids = (known after apply)
      + size        = 20
      + status      = (known after apply)
      + type        = "network-hdd"
      + zone        = "ru-central1-b"
    }

  # yandex_compute_instance.master01 will be created
+ resource "yandex_compute_instance" "master01" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hostname                  = "master01.netology.yc"
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCTR2s2Gjdpv2Sq9gBVGnsnZaN0hr8h+N05s03RZOgucyFZ7b2rRlav36Bl8Dg1noje9+o5zIha9bNYwpBmZLGJRsYLI9mmh7NRruapJr/nUYNcbzsZCRvRq85aORorA78KE86sCHgzaA4DNdY3B6TIVInVC1SvImwmhNKZaLu+yqk1v04T6AjfPc5QLb+tors3r2r+5esNj/8Ej9HEGsnXVQmcXRmRRck7FINXxoJdSgOFoKYYnLwCGboXeCtL7sl2G40HLqcclnjVs3lwXZkvkcmWmJcL02aqT4BtL+pDG6D9SUGu3kJIuD3+X+RcMPh+w83bDsefn6dF2s3R1Y06AdAr8JiyHDPsDvsImopCH8udwGCSemSCpo0Xq4LRx0SZx288PaHwFgNUgVZq0g2yIr2D5twAq0m7TWqbvi0qYOIoUbDc3CaDlmcZw9Zrq3rled8UyAjPHwb4sgzOroIavsfvEhkba97qmw/W6RcdjHphwjM/QaWJ8Ye4AK+uRFM= yelena@DESKTOP-T14F2UM
            EOT
        }
      + name                      = "master01"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-b"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd80d16oleqvtagvi2ht"
              + name        = "root-master01"
              + size        = 44
              + snapshot_id = (known after apply)
              + type        = "network-nvme"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = "192.168.20.20"
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = "e2llb9ra3djq3sg6vdm5"
        }

      + resources {
          + core_fraction = 100
          + cores         = 2
          + memory        = 4
        }

      + secondary_disk {
          + auto_delete = true
          + device_name = "nfs"
          + disk_id     = (known after apply)
          + mode        = "READ_WRITE"
        }
    }

  # yandex_compute_instance.worker01 must be replaced
-/+ resource "yandex_compute_instance" "worker01" {
      ~ created_at                = "2024-01-31T19:50:11Z" -> (known after apply)
      ~ folder_id                 = "b1gse6fjmhipl4je57pj" -> (known after apply)
      ~ fqdn                      = "worker01.netology.yc" -> (known after apply)
      + gpu_cluster_id            = (known after apply)
      ~ id                        = "epduv44ssb18pfvp61lp" -> (known after apply)
      - labels                    = {} -> null
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
        name                      = "worker01"
      + service_account_id        = (known after apply)
      ~ status                    = "running" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name = "epdcamj5uto4540jan2n" -> (known after apply)
          ~ disk_id     = "epdcamj5uto4540jan2n" -> (known after apply)
          ~ mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ initialize_params {
              ~ block_size  = 4096 -> (known after apply)
              + description = (known after apply)
                name        = "root-worker01"
              + snapshot_id = (known after apply)
              ~ type        = "network-ssd" -> "network-nvme" # forces replacement
                # (2 unchanged attributes hidden)
            }
        }

      - metadata_options {
          - aws_v1_http_endpoint = 1 -> null
          - aws_v1_http_token    = 2 -> null
          - gce_http_endpoint    = 1 -> null
          - gce_http_token       = 1 -> null
        }

      ~ network_interface {
          ~ index              = 0 -> (known after apply)
          ~ ipv6               = false -> (known after apply)
          + ipv6_address       = (known after apply)
          ~ mac_address        = "d0:0d:1e:f9:09:ce" -> (known after apply)
          ~ nat_ip_address     = "62.84.121.112" -> (known after apply)
          ~ nat_ip_version     = "IPV4" -> (known after apply)
          ~ security_group_ids = [] -> (known after apply)
            # (4 unchanged attributes hidden)
        }

      - placement_policy {
          - host_affinity_rules       = [] -> null
          - placement_group_partition = 0 -> null
        }

      ~ resources {
          - gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

      - scheduling_policy {
          - preemptible = false -> null
        }
    }

  # yandex_compute_instance.worker02 must be replaced
-/+ resource "yandex_compute_instance" "worker02" {
      ~ created_at                = "2024-01-31T19:50:08Z" -> (known after apply)
      ~ folder_id                 = "b1gse6fjmhipl4je57pj" -> (known after apply)
      ~ fqdn                      = "worker02.netology.yc" -> (known after apply)
      + gpu_cluster_id            = (known after apply)
      ~ id                        = "epdruqs5hfbgc2mgm3lv" -> (known after apply)
      - labels                    = {} -> null
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
        name                      = "worker02"
      + service_account_id        = (known after apply)
      ~ status                    = "running" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name = "epdju5viujvrrg861bif" -> (known after apply)
          ~ disk_id     = "epdju5viujvrrg861bif" -> (known after apply)
          ~ mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ initialize_params {
              ~ block_size  = 4096 -> (known after apply)
              + description = (known after apply)
                name        = "root-worker02"
              + snapshot_id = (known after apply)
              ~ type        = "network-ssd" -> "network-nvme" # forces replacement
                # (2 unchanged attributes hidden)
            }
        }

      - metadata_options {
          - aws_v1_http_endpoint = 1 -> null
          - aws_v1_http_token    = 2 -> null
          - gce_http_endpoint    = 1 -> null
          - gce_http_token       = 1 -> null
        }

      ~ network_interface {
          ~ index              = 0 -> (known after apply)
          ~ ipv6               = false -> (known after apply)
          + ipv6_address       = (known after apply)
          ~ mac_address        = "d0:0d:1b:f6:b8:58" -> (known after apply)
          ~ nat_ip_address     = "51.250.109.204" -> (known after apply)
          ~ nat_ip_version     = "IPV4" -> (known after apply)
          ~ security_group_ids = [] -> (known after apply)
            # (4 unchanged attributes hidden)
        }

      - placement_policy {
          - host_affinity_rules       = [] -> null
          - placement_group_partition = 0 -> null
        }

      ~ resources {
          - gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

      - scheduling_policy {
          - preemptible = false -> null
        }
    }

Plan: 5 to add, 0 to change, 2 to destroy.

Changes to Outputs:
~ external_ip_address_node00 = "51.250.109.204" -> (known after apply)
~ external_ip_address_node01 = "62.84.121.112" -> (known after apply)
~ external_ip_address_node02 = "51.250.109.204" -> (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](http://171f61c8c11b:4141/lock?id=Scandr%252Fnetology_devops_diploma%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 5 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`